```diff
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/exaf-epfl/doge-test/runs/run-HivLLZUuup3g4jq8

Waiting for the plan to start...

Terraform v1.2.4
on linux_amd64
Initializing plugins and modules...
module.base.tls_private_key.ssh_key: Refreshing state... [id=193469a242a240947664ce9dfb9bcb921746cc4a]
module.base.digitalocean_project.do_project: Refreshing state... [id=84b01ff6-9dda-471d-b8fb-126387bb97ad]
module.base.digitalocean_ssh_key.ssh_key: Refreshing state... [id=35847374]
module.base.data.template_file.cloud-init-yaml: Reading...
module.base.data.template_file.cloud-init-yaml: Read complete after 0s [id=5d27bca5178bf5fc00055a4761f1760513ba347ebc0e6abf276de971ca4b7267]
module.base.github_repository.repo: Refreshing state... [id=doge-test]
module.base.github_branch.develop: Refreshing state... [id=doge-test:develop]
module.base.github_branch_protection.staging: Refreshing state... [id=BPR_kwDOHwryJM4Bp0sU]
module.base.github_actions_secret.ssh_key: Refreshing state... [id=doge-test:ssh_key]
module.base.github_branch.staging: Refreshing state... [id=doge-test:staging]
module.infrastructure.github_repository_environment.env: Refreshing state... [id=doge-test:staging]
module.base.github_branch_protection.develop: Refreshing state... [id=BPR_kwDOHwryJM4Bp0sV]
module.infrastructure.github_actions_environment_secret.droplet_user: Refreshing state... [id=doge-test:staging:droplet_user]
module.infrastructure.digitalocean_droplet.droplet: Refreshing state... [id=311032656]
module.infrastructure.github_actions_environment_secret.droplet_host: Refreshing state... [id=doge-test:staging:droplet_host]
module.infrastructure.github_actions_environment_secret.known_hosts: Refreshing state... [id=doge-test:staging:known_hosts]
module.infrastructure.digitalocean_project_resources.droplets: Refreshing state... [id=84b01ff6-9dda-471d-b8fb-126387bb97ad]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.base.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit     = false -> true
        id                     = "doge-test"
        name                   = "doge-test"
        # (29 unchanged attributes hidden)
    }

  # module.infrastructure.data.sshclient_host.host will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_host" "host" {
      + hostname                 = (known after apply)
      + id                       = (known after apply)
      + insecure_ignore_host_key = true
      + json                     = (known after apply)
      + username                 = "keyscan"
    }

  # module.infrastructure.data.sshclient_keyscan.keyscan will be read during apply
  # (config refers to values not yet known)
 <= data "sshclient_keyscan" "keyscan" {
      + authorized_key = (known after apply)
      + host_json      = (sensitive value)
      + id             = (known after apply)
    }

  # module.infrastructure.digitalocean_droplet.droplet must be replaced
-/+ resource "digitalocean_droplet" "droplet" {
      ~ created_at           = "2022-08-03T09:10:39Z" -> (known after apply)
      ~ disk                 = 80 -> (known after apply)
      ~ id                   = "311032656" -> (known after apply)
      ~ ipv4_address         = "68.183.219.8" -> (known after apply)
      ~ ipv4_address_private = "10.114.0.6" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 4096 -> (known after apply)
        name                 = "doge-test-staging"
      ~ price_hourly         = 0.03571 -> (known after apply)
      ~ price_monthly        = 24 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
      - tags                 = [] -> null
      ~ urn                  = "do:droplet:311032656" -> (known after apply)
      ~ user_data            = "e33f60e227c3ab5cfbe8eb560626890c2f5777b8" -> "cbcd2bd33d72eaec63850a83532abb7d72f479d9" # forces replacement
      ~ vcpus                = 2 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "1c258bb0-6336-4320-95de-1fb9e3184054" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.infrastructure.digitalocean_project_resources.droplets will be updated in-place
  ~ resource "digitalocean_project_resources" "droplets" {
        id        = "84b01ff6-9dda-471d-b8fb-126387bb97ad"
      ~ resources = [
          - "do:droplet:311032656",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.infrastructure.github_actions_environment_secret.droplet_host must be replaced
-/+ resource "github_actions_environment_secret" "droplet_host" {
      ~ created_at      = "2022-08-03 09:11:51 +0000 UTC" -> (known after apply)
      ~ id              = "doge-test:staging:droplet_host" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-08-03 09:11:51 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.infrastructure.github_actions_environment_secret.known_hosts must be replaced
-/+ resource "github_actions_environment_secret" "known_hosts" {
      ~ created_at      = "2022-08-03 09:33:28 +0000 UTC" -> (known after apply)
      - encrypted_value = (sensitive value)
      ~ id              = "doge-test:staging:known_hosts" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2022-08-03 09:33:28 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 2 to change, 3 to destroy.

Changes to Outputs:
  ~ ipv4_address = "68.183.219.8" -> (known after apply)
  # Warning: this attribute value will be marked as sensitive and will not
  # display in UI output after applying this change.
  ~ known_hosts  = (sensitive value)

```